////////////////////////////////////////////////////////////////////////////
// fl01.cpp
// Простейшее приложение с использованием FLTK
#include <FL/Fl.H>                          // базовые части fltk приложения
#include <FL/Fl_Window.H>                   // класс с простейшим окошком

int main(){
   Fl_Window win(300, 200, "Hello, fltk");  // создаем окно
   win.show();                              // отображаем окно
   return Fl::run();                        // запускаем обработчик событий
}
// end of file fl01.cpp
////////////////////////////////////////////////////////////////////////////
